Ran Plan for project: `Production` dir: `infra/terraform/environment/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.main.module.gke.google_container_cluster.primary has changed
~ resource "google_container_cluster" "primary" {
        id                                       = "projects/spino-cup-2024/locations/asia-northeast1/clusters/spino-gke-prod"
      ~ master_version                           = "1.30.3-gke.1639000" -> "1.30.3-gke.1969001"
        name                                     = "spino-gke-prod"
        # (32 unchanged attributes hidden)

        # (24 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.main.google_artifact_registry_repository.docker will be created
+ resource "google_artifact_registry_repository" "docker" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "spino-cup-2024"
      + repository_id    = "spino-docker-prod"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # module.main.google_secret_manager_secret.db_password will be created
+ resource "google_secret_manager_secret" "db_password" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "spino-cup-2024"
      + secret_id             = "db-password"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # module.main.google_secret_manager_secret_version.db_password_version will be created
+ resource "google_secret_manager_secret_version" "db_password_version" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # module.main.google_sql_database.main will be created
+ resource "google_sql_database" "main" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "spino-db-instance-prod"
      + name            = "spino-db-prod"
      + project         = "spino-cup-2024"
      + self_link       = (known after apply)
    }

  # module.main.google_sql_database_instance.main will be created
+ resource "google_sql_database_instance" "main" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_8_0"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "spino-db-instance-prod"
      + private_ip_address             = (known after apply)
      + project                        = "spino-cup-2024"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-custom-2-7680"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration (known after apply)

          + insights_config (known after apply)

          + ip_configuration {
              + ipv4_enabled   = true
              + server_ca_mode = (known after apply)
              + ssl_mode       = (known after apply)
            }

          + location_preference (known after apply)
        }
    }

  # module.main.google_sql_user.db_user will be created
+ resource "google_sql_user" "db_user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "spino-db-instance-prod"
      + name                    = "spino"
      + password                = (sensitive value)
      + project                 = "spino-cup-2024"
      + sql_server_user_details = (known after apply)
    }

  # module.main.local_file.kubeconfig will be created
+ resource "local_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "spino-kubeconfig-prod"
      + id                   = (known after apply)
    }

  # module.main.random_password.db_password will be created
+ resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p Production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=tosaken1116%252Fspino_cup_2024%252Finfra%252Fterraform%252Fenvironment%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p Production
  ```

**Note: Objects have changed outside of Terraform**
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```